import numpy as np
import matplotlib.pyplot as plt

x = np.array([100,10100,20100,30100,40100,50100,60100,70100,80100,90100,100100,110100,120100,130100,140100,150100,160100,170100,180100,190100,200100,210100,220100,230100,240100,250100,260100,270100])
y = np.array([6,548,1116,1659,2209,2753,3297,3848,4394,4998,5505,6044,6584,7131,7679,8257,8777,9340,9882,10426,10968,11603,12074,12628,13166,13731,14303,14854])
plt.plot(x, y)
plt.title("Зависимость времени от количества элементов при полном переборе")
plt.xlabel("количество элементов в массиве")
plt.ylabel("время выполнения функции, мсек")
plt.show()

