import numpy as np
import matplotlib.pyplot as plt

x = np.array([100,110,120,130,140,150,160,170,180,190,200,210,220,230,240,250,260,270,280,290,300,310,320,330,340,350,360,370,380,390,400,410,420,430,440,450,460,470,480,490])
y = np.array([487,582,684,800,917,1064,1194,1322,1481,1649,1809,1980,2155,2352,2544,2769,2982,3184,3437,3678,3936,4183,4467,4747,5016,5293,5588,5904,6182,6519,6820,7141,7497,7815,8264,8561,8936,9294,9683,10191])
plt.plot(x, y)
plt.title("Квадратичная асимптотика поиска 2 элементов")
plt.xlabel("количество элементов в массиве")
plt.ylabel("время выполнения функции, мсек")
plt.show()

